In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series(['1.0','2000',3000])

In [3]:
print(s)

0     1.0
1    2000
2    3000
dtype: object

In [4]:
s1 = pd.to_numeric(s) #We use to_numeric to convert data to numeric or float format

In [5]:
print(s1)

0       1.0
1    2000.0
2    3000.0
dtype: float64

In [6]:
s2 = pd.Series(['1.0','#APPLE', 2000])

In [7]:
pd.to_numeric(s2) #ignore argument

ValueError: Unable to parse string "#APPLE" at position 1

In [8]:
a = pd.to_numeric(s2, errors = 'coerce')
#Coerce is used to convert any unconvertable format into null values

In [10]:
print(a)

0       1.0
1       NaN
2    2000.0
dtype: float64

In [12]:
de = {'training':['DS','RL','DL','AI'], 'Assignment':[np.nan,np.nan,5,6], 'tools':[np.nan,np.nan,np.nan,4]}

In [51]:
df1 = pd.DataFrame(de)

In [52]:
print(df1)

  training  Assignment  tools
0       DS         NaN    NaN
1       RL         NaN    NaN
2       DL         5.0    NaN
3       AI         6.0    4.0

In [19]:
df1.shape

(4, 3)

In [18]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
training      4 non-null object
Assignment    2 non-null float64
tools         1 non-null float64
dtypes: float64(2), object(1)
memory usage: 224.0+ bytes

In [21]:
df1.isnull().sum()

training      0
Assignment    2
tools         3
dtype: int64

In [22]:
#handling null values
df1.dropna(axis = 0) #By using dropna we are able to drop entire row which contains the null value

  training  Assignment  tools
3       AI         6.0    4.0

In [23]:
df1.dropna(axis=1) #by using axis=1 we are able to drop entire column

  training
0       DS
1       RL
2       DL
3       AI

In [6]:
df1.dropna(subset = ['Assignment'])

  training  Assignment  tools
2       DL         5.0    NaN
3       AI         6.0    4.0

In [19]:
df1.dropna(subset = ['tools'])

  training  hours  tools
3       AI    4.0    4.0

In [44]:
df1.dropna(thresh =4) #Thresh checks for number of null values in specific column and drops the rows

Empty DataFrame
Columns: [training, Assignment, tools]
Index: []

### df

In [11]:
#Filling the null values
df1.fillna('Hai')

  training Assignment tools
0       DS        Hai   Hai
1       RL        Hai   Hai
2       DL          5   Hai
3       AI          6     4

In [13]:
df1.fillna(df1.mean())

  training  Assignment  tools
0       DS         5.5    4.0
1       RL         5.5    4.0
2       DL         5.0    4.0
3       AI         6.0    4.0

In [45]:
df1.replace(4, 'four')

  training  Assignment tools
0       DS         NaN   NaN
1       RL         NaN   NaN
2       DL         5.0   NaN
3       AI         6.0  four

In [46]:
df1 = df1.replace([5,4], '12#WhEREisMyAssignMent??')

In [47]:
df1

  training                Assignment                     tools
0       DS                       NaN                       NaN
1       RL                       NaN                       NaN
2       DL  12#WhEREisMyAssignMent??                       NaN
3       AI                         6  12#WhEREisMyAssignMent??

In [53]:
df1.replace([5,6],[222, 442])

  training  Assignment  tools
0       DS         NaN    NaN
1       RL         NaN    NaN
2       DL       222.0    NaN
3       AI       442.0    4.0

In [54]:
df1.iloc[1,2] = 'hai123$#$HAI'

In [55]:
df1.iloc[2,2] = 'hello342HAI$%%%$'

In [24]:
df1

  training  Assignment             tools
0       DS         NaN               NaN
1       RL         NaN      hai123$#$HAI
2       DL         5.0  hello342HAI$%%%$
3       AI         6.0                 4

In [60]:
df1.replace(regex = True, to_replace = '[^A-Za-z0-9]', value = '')

  training  Assignment tools
0                  NaN   NaN
1                  NaN   123
2                  5.0   342
3                  6.0     4

In [63]:
df1.iloc[:,1:3] = df1.iloc[:,1:3].replace(regex= True, to_replace = '[^0-9]', value = '')

In [74]:
df1.iloc[:,[0,2]]

  training tools
0       DS   NaN
1       RL   123
2       DL   342
3       AI     4

In [75]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
training    4 non-null object
Tools       4 non-null object
fee         3 non-null object
dtypes: object(3)
memory usage: 176.0+ bytes

In [34]:
#Joining
a = df.append(df1) #To perform row wise joining
print(a.shape)
print(a)

(8, 3)
  training  Assignment tools
0       DS         NaN   NaN
1       RL         NaN   NaN
2       DL         5.0   NaN
3       AI         6.0     4
0       DS         NaN   NaN
1       RL         NaN   123
2       DL         5.0   342
3       AI         6.0     4

In [36]:
pd.concat([df, df1], axis = 0)

  training  Assignment tools
0       DS         NaN   NaN
1       RL         NaN   NaN
2       DL         5.0   NaN
3       AI         6.0     4
0       DS         NaN   NaN
1       RL         NaN   123
2       DL         5.0   342
3       AI         6.0     4

In [88]:
e

  Tools  fee training
0     2    3       DS
1     4   30       ML
2     2  NaN       DL
3     4    4       DS
0   NaN  NaN       DS
1   NaN  NaN       ML
2     2  NaN       DL
3     4  NaN       DS

In [95]:
df

  training Tools  fee
0       DS     2    3
1       ML     4   30
2       DL     2  NaN
3       DS     4    4

In [96]:
df1

  training  hours
0       DS    NaN
1       ML    NaN
2       DL    2.0
3       AI    4.0

In [37]:
pd.merge(df,df1, how = 'left', on = 'training')

  training  Assignment_x  tools_x  Assignment_y tools_y
0       DS           NaN      NaN           NaN     NaN
1       RL           NaN      NaN           NaN     123
2       DL           5.0      NaN           5.0     342
3       AI           6.0      4.0           6.0       4

In [38]:
pd.merge(df,df1, how = 'right', on = 'training')

  training  Assignment_x  tools_x  Assignment_y tools_y
0       DS           NaN      NaN           NaN     NaN
1       RL           NaN      NaN           NaN     123
2       DL           5.0      NaN           5.0     342
3       AI           6.0      4.0           6.0       4

In [39]:
pd.merge(df,df1, how = 'inner', on = 'training')

  training  Assignment_x  tools_x  Assignment_y tools_y
0       DS           NaN      NaN           NaN     NaN
1       RL           NaN      NaN           NaN     123
2       DL           5.0      NaN           5.0     342
3       AI           6.0      4.0           6.0       4

In [42]:
s = pd.Series([1,2,3,2,3,4])

In [43]:
s.replace(2, method ='bfill')

0    1
1    3
2    3
3    3
4    3
5    4
dtype: int64

In [44]:
s.replace(2, method ='ffill')

0    1
1    1
2    3
3    3
4    3
5    4
dtype: int64

In [47]:
df1.drop(df1.columns[2], axis = 1)

  training hours
0       DS   NaN
1       ML   NaN
2       DL    12
3       AI    12

In [17]:
df1.astype(int)

ValueError: Cannot convert non-finite values (NA or inf) to integer

In [48]:
del heart['ca']

NameError: name 'heart' is not defined

In [45]:
a = pd.melt(df1)

In [46]:
pd.melt(df1)

      variable value
0     training    DS
1     training    RL
2     training    DL
3     training    AI
4   Assignment   NaN
5   Assignment   NaN
6   Assignment     5
7   Assignment     6
8        tools   NaN
9        tools   123
10       tools   342
11       tools     4

In [49]:
df1[df.training.isin(df1.training)]

  training  Assignment tools
0       DS         NaN   NaN
1       RL         NaN   123
2       DL         5.0   342
3       AI         6.0     4

In [60]:
df

  training  Assignment  tools
0       DS         NaN    NaN
1       RL         NaN    NaN
2       DL         5.0    NaN
3       AI         6.0    4.0

In [61]:
df1

  training  hours  tools
0       DS    NaN    NaN
1       ML    NaN    NaN
2       DL    2.0    NaN
3       AI    4.0    4.0

In [56]:
a = df.training.isin(df1.training)

In [59]:
df1[a]

  training  hours  tools
0       DS    NaN    NaN
2       DL    2.0    NaN
3       AI    4.0    4.0

In [ ]:
data[data['state'] < 20] # Rows where the column col is greater than 0.5

In [ ]:

df.sort_values([col1,col2],ascending=[True,False]) # Sort values by col1 in ascending order then col2 in descending order

In [ ]:
df.sort_values(col2,ascending=False) # Sort values by col2 in descending order

In [ ]:
df[(df[] > 0.5) & (df[col] < 0.7)] # Rows where 0.7 > col > 0.5

In [ ]:
df.sort_values(col1) # Sort values by col1 in ascending order